#1.内连接
#  如果一张表的记录（有个字段记录另外一张表的主键），能够在另外一张表中匹配上，那么就保存，否则就不保存。
#  左表：join关键字左边的表称之为左表
#  右表：join关键字右表的表称之为右表
#  语法：左表 [inner] join 右表 on/where 连接条件
#  内连接原理：
#  内连接的on条件可以使用where来进行匹配
#  内连接还可以通过使用多表查询，但是使用条件匹配来实现

#2.外连接(常用)
#  与内连接相似，如果主表（左外连接左表为主表，右外连接右表为主表）的记录在副表中匹配不上，那么该记录依然保留，只是副表字段都置空
#  语法：左表 left/right [outer] join 右表 on 连接条件
#  左外连接：以左表为主表，使用关键字left
#  右外连接：以右表为主表，使用关键字right
select * from class left join teacher on class.teacher_id = teacher.id;

# 内连接与外连接的区别
# 1.内连接的条件可以使用where关键字，外连接不行
# 2.内连接可以没有条件，而外连接必须指定条件
# 3.内连接只保留匹配成功的记录，而外连接会保留主表的全部记录

# 外连接左右可以互相转换
# 不管是内连接还是外连接，都可以进行多表连接（超过两张表）

#3.交叉连接
#  笛卡尔积
#  语法：左表 cross join 右表

#4.自然连接
#  两个表之间的连接不需要指定连接条件，系统自动找条件，并按照条件进行处理。
#  自然连接可以包含内连接，外连接和交叉连接
#  语法：左表 natural [left/right] join 右表
#  左表 natural join 右表：自然内连接
#  左表 natural [left/right] join右表：自然外连接
#  自然连接自动寻找连接条件：会判断两张表中是否有同样的字段名称，如果有，则作为连接条件，否则就没有条件
#  自然连接，会合并相同的字段
#  自然连接：会将主表放在左边显示，副表放在右边显示








